{
    "subtitle": {
      "value": "Experiência"
    },
    "companies": [
      {
        "year": "2021",
        "title": "Compass.uol",
        "role": "Estágio",
        "description": "Durante 4 meses, a empresa nos forneceu estrutura para aprendermos React JS e suas principais funcionalidades e bibliotecas. Como projeto final, desenvolvemos em equipe uma aplicação que é uma espécie de clone da Netflix utilizando as principais funcionalidades do React JS",
        "skills": ["HTML", "CSS", "JavaScript", "React JS"]
      },
      {
        "year": "2022",
        "title": "Compass.uol",
        "role": "Desenvolvedor Mobile",
        "description": "Participação em uma equipe de sustentabilidade para o aplicativo Carmen Steffens em React Native.",
        "skills": ["React Native"]
      },
      {
        "year": "2022",
        "title": "Compass.uol",
        "role": "Desenvolvedor Front-End",
        "description": "Implementação de telas e funcionalidades para o projeto da Esfera do banco Santander",
        "skills": ["HTML", "CSS", "JavaScript", "React JS","SASS","TypeScript"]
      },
      {
        "year": "2023",
        "title": "Valtech",
        "role": "Desenvolvedor Front-End",
        "description": "Gerenciei solicitações de clientes, implementei novas funcionalidades, corrigi bugs e integrei sistemas CMS Headless para gestão de conteúdo dinâmica. Atuei na entrega de software, orientando equipes em reuniões, apresentando KPI’s técnicos e administrando cronogramas para executivos. Desenvolvi componentes responsivos com React e Vue, alinhados a designs no Figma, garantindo uma experiência de usuário moderna. Contribuí para o sucesso de projetos como Chemyunion, Hemophilia, Flu Shots V2, Redesign de Sinuberase/Aderogyl, CBMM, e Calculadora Dysport - Galderma.",
        "skills": ["HTML", "CSS", "JavaScript", "React JS","SASS","TypeScript","Testes Unitários"]
      },
      {
        "year": "2024",
        "title": "CI&T",
        "role": "Desenvolvedor Front-End",
        "description": "Desenvolvo interfaces de usuário dinâmicas e responsivas para o Projeto Porto Seguro, utilizando React e TypeScript para garantir um código robusto e de fácil manutenção. Implementei estilos modulares com SCSS, assegurando consistência visual em diversos dispositivos e breakpoints. Além disso, criei e mantive testes unitários, contribuindo para a qualidade e estabilidade do projeto.",
        "skills": ["HTML", "CSS", "JavaScript", "React JS","SASS","TypeScript","Testes Unitários"]
      }
    ],
    "description": "<p>Sou desenvolvedor <strong class=\"teste\">Front-End</strong> na CI&T. Formado em <strong class=\"teste\"> Engenharia de software</strong> na PUC Minas.</p>"

  }
  